#include <stdio.h>

// ЯП си создавался для Unix систем, когда не было графического интерфеса была только командная строка

int main(int argc, char* argv[]){ // argc - кол-во аргументов командной строки
                                  // argv[] это  массив указателей на строки
    printf("Hello World\n");
    printf("Hello %s! \n", "Leonid");

    /*!
     * %c - Символ
      %s - Строка символов
      %d, i - Целое десятичное со знаком
      %o - Целое восьмеричное
      %u - Целое десятичное без знака
      %x, X - Целое шестнадцатеричное
      %f - Дробное число в фиксированном формате
      %e, E - Дробное число в научном формате
      %g, G - Дробное число в научном или фиксированном формате
      %p - Указатель (в шестнадцатеричном виде)
     *
     */


    return 0;
}

