#include <stdio.h>
#include <stdlib.h>


/*!
 * C- яѕ высокого уровн€
 * компил€ци€ - процесс создани€ исходного фала из \кода , операци€ выполн€етс€ компил€тором
 * ќ— - контролирует вычислительные процесс, ставит его на исполнение,осуществл€ет загрузку.
 * компил€тор встретив ошибку прекращает процесс компил€ции
*/


int main(){
  printf("Hello, my name is Lol\n"
           "What is you name?\n");
    char name[20];  // строка должна быть массивом символов!
    scanf("%s", name); // указатель на name не нужен
    printf("Hello, %s! How old are you? \n", name);
    int year;
    scanf ("%d", &year); // указатель на name нужен

    return 0;
}
